Revit 2024 API
ConduitSizeSettings.DoesConduitStandardTypeExist Method
 Checks if the specified conduit standard exist.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool DoesConduitStandardTypeExist(
	string standardName
)
Visual Basic
Public Function DoesConduitStandardTypeExist ( _
	standardName As String _
) As Boolean
Visual C++
public:
bool DoesConduitStandardTypeExist(
	String^ standardName
)
Parameters
standardName
Type: System.String
 The conduit standard name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace